benchmark/xmin-horizon/results/s1-skiplocked/bystander.log
pgbench (18.3, server 17.9 (Debian 17.9-1.pgdg13+1))
starting vacuum...pgbench: error: ERROR:  relation "pgbench_branches" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_tellers" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_history" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
end.
progress: 5.0 s, 100.6 tps, lat 1.415 ms stddev 1.618, 0 failed, lag 1.020 ms, 0 skipped
progress: 10.0 s, 105.1 tps, lat 1.261 ms stddev 1.294, 0 failed, lag 0.988 ms, 0 skipped
progress: 15.0 s, 98.1 tps, lat 1.338 ms stddev 1.629, 0 failed, lag 1.005 ms, 0 skipped
progress: 20.0 s, 103.3 tps, lat 1.149 ms stddev 1.365, 0 failed, lag 0.841 ms, 0 skipped
progress: 25.0 s, 103.4 tps, lat 1.276 ms stddev 1.251, 0 failed, lag 0.972 ms, 0 skipped
progress: 30.0 s, 98.4 tps, lat 1.284 ms stddev 1.357, 0 failed, lag 1.043 ms, 0 skipped
progress: 35.0 s, 99.6 tps, lat 1.376 ms stddev 1.396, 0 failed, lag 1.099 ms, 0 skipped
progress: 40.0 s, 106.5 tps, lat 1.241 ms stddev 1.228, 0 failed, lag 0.964 ms, 0 skipped
progress: 45.0 s, 97.4 tps, lat 1.464 ms stddev 1.415, 0 failed, lag 1.135 ms, 0 skipped
progress: 50.0 s, 97.5 tps, lat 1.356 ms stddev 1.377, 0 failed, lag 1.069 ms, 0 skipped
progress: 55.0 s, 94.6 tps, lat 1.340 ms stddev 1.358, 0 failed, lag 1.055 ms, 0 skipped
progress: 60.0 s, 94.8 tps, lat 1.345 ms stddev 1.339, 0 failed, lag 1.075 ms, 0 skipped
progress: 65.0 s, 98.0 tps, lat 1.372 ms stddev 1.328, 0 failed, lag 1.047 ms, 0 skipped
progress: 70.0 s, 97.9 tps, lat 1.261 ms stddev 1.303, 0 failed, lag 0.999 ms, 0 skipped
progress: 75.0 s, 100.7 tps, lat 1.419 ms stddev 1.919, 0 failed, lag 0.971 ms, 0 skipped
progress: 80.0 s, 96.2 tps, lat 1.509 ms stddev 1.421, 0 failed, lag 1.130 ms, 0 skipped
progress: 85.0 s, 96.0 tps, lat 1.331 ms stddev 1.447, 0 failed, lag 0.950 ms, 0 skipped
progress: 90.0 s, 97.4 tps, lat 1.398 ms stddev 1.351, 0 failed, lag 1.102 ms, 0 skipped
progress: 95.0 s, 103.5 tps, lat 1.349 ms stddev 1.283, 0 failed, lag 1.031 ms, 0 skipped
progress: 100.0 s, 100.9 tps, lat 1.422 ms stddev 1.345, 0 failed, lag 1.126 ms, 0 skipped
progress: 105.0 s, 91.0 tps, lat 1.456 ms stddev 1.392, 0 failed, lag 1.161 ms, 0 skipped
progress: 110.0 s, 94.6 tps, lat 1.669 ms stddev 2.139, 0 failed, lag 1.255 ms, 0 skipped
progress: 115.0 s, 102.6 tps, lat 1.239 ms stddev 1.281, 0 failed, lag 0.988 ms, 0 skipped
progress: 120.0 s, 100.8 tps, lat 1.546 ms stddev 2.238, 0 failed, lag 1.175 ms, 0 skipped
progress: 125.0 s, 94.8 tps, lat 1.416 ms stddev 1.332, 0 failed, lag 1.087 ms, 0 skipped
progress: 130.0 s, 105.6 tps, lat 1.226 ms stddev 1.263, 0 failed, lag 0.974 ms, 0 skipped
progress: 135.0 s, 93.2 tps, lat 1.269 ms stddev 1.319, 0 failed, lag 0.986 ms, 0 skipped
progress: 140.0 s, 103.4 tps, lat 1.314 ms stddev 1.224, 0 failed, lag 1.011 ms, 0 skipped
progress: 145.0 s, 105.3 tps, lat 1.691 ms stddev 2.483, 0 failed, lag 1.188 ms, 0 skipped
progress: 150.0 s, 103.4 tps, lat 1.325 ms stddev 1.433, 0 failed, lag 1.015 ms, 0 skipped
progress: 155.0 s, 93.0 tps, lat 1.336 ms stddev 1.356, 0 failed, lag 1.063 ms, 0 skipped
progress: 160.0 s, 98.3 tps, lat 1.138 ms stddev 1.211, 0 failed, lag 0.858 ms, 0 skipped
progress: 165.0 s, 100.8 tps, lat 1.309 ms stddev 1.334, 0 failed, lag 1.048 ms, 0 skipped
progress: 170.0 s, 102.4 tps, lat 1.209 ms stddev 1.275, 0 failed, lag 0.956 ms, 0 skipped
progress: 175.0 s, 98.4 tps, lat 1.223 ms stddev 1.240, 0 failed, lag 0.949 ms, 0 skipped
transaction type: /Users/nik/github/pgque/.claude/worktrees/agent-a48559ba7fdb1315c/bench/xmin-horizon/scripts/bystander.bench
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 17903
number of failed transactions: 0 (0.000%)
number of transactions skipped: 0 (0.000%)
number of transactions above the 200.0 ms latency limit: 0/17903 (0.000%)
latency average = 1.350 ms
latency stddev = 1.482 ms
rate limit schedule lag: avg 1.037 (max 20.904) ms
initial connection time = 10.084 ms
tps = 99.466755 (without initial connection time)